In [ ]:
# 필요한 패키지 설치하기 (한번만 실행)
!pip install ipython-sql

In [1]:
# SQL 확장 기능 로드하기
%load_ext sql

# 메모리 기반 임시 데이터베이스 연결(커널이 재시작 되면 다시 실행 해야함)
%sql sqlite:///:memory:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

#%sql sqlite:///my_test_db1.db ~

In [2]:
%%sql

CREATE TABLE test_table (
    id INTEGER PRIMARY KEY,
    name TEXT,
    value INTEGER
);

INSERT INTO test_table (name, value) VALUES ('현우', 100);
INSERT INTO test_table (name, value) VALUES ('철수', 200);

 * sqlite:///:memory:
Done.
1 rows affected.
1 rows affected.

[]

In [3]:
%%sql
SELECT * FROM test_table;

 * sqlite:///:memory:
Done.

[(1, '현우', 100), (2, '철수', 200)]